{
    "what is python": "Python is a powerful and easy-to-learn programming language.",
    "who are you": "I am your personal voice assistant, created to help you.",
    "what is ai": "AI stands for Artificial Intelligence, the simulation of human intelligence in machines.",
    "how are you": "I'm functioning perfectly, thank you!",
    "what is your name": "My name is Praggya.",
    "who created you": "I was created by a brilliant mind whose name Soumyadeep who wanted a smarter assistant.",
    
    "what can you do": "I can open websites, play songs, answer simple questions, and more.",
    "tell me a joke": "Why did the computer get cold? Because it forgot to close its windows!",
    "are you real": "As real as software can be!",
    "do you sleep": "Nope, I'm always listening... unless you tell me to stop.",
    "can you dance": "I can't dance, but I can help you find dance videos!",
    "tell me a fun fact": "Did you know? The first computer bug was an actual moth stuck in a computer.",
    "are you smarter than alexa": "Let's just say I'm different — and proud of it!",
    "do you like music": "I love music! Ask me to play a song for you.",
    "what is machine learning": "Machine learning is a type of AI that allows computers to learn from data and improve over time.",
    "can you help me": "Of course! Just tell me what you need.",
    "do you love me": "As much as a virtual assistant possibly can!",
    "what is your purpose": "I am here to assist you with tasks and answer your questions.",
    "can you set an alarm": "Currently, I don't support alarms, but you can ask me to remind you of things in the future.",
    "can you control lights": "I'm not connected to smart devices yet, but maybe one day!",
    "what is the capital of france": "The capital of France is Paris.",
    
    "can you solve math problems": "Yes, if you ask simple math, I can try to answer it.",
    "who is elon musk": "Elon Musk is a billionaire entrepreneur known for Tesla and SpaceX.",
    "what is the weather today": "I can't check the weather without internet access, but I can suggest opening a weather site.",
    "do you have a brain": "Not really, but I run on code and logic!",
    "can you hear me": "Loud and clear.",
    "what is love": "Love is a complex emotion. You might want to ask a poet!",
    "can you tell a story": "Once upon a time, there was a brilliant user who created an amazing assistant...",
    "how do you work": "I process your voice commands and try to perform helpful tasks.",
    "do you have emotions": "Not yet, but I can pretend if you'd like!",
    "can you cook": "I wish! But I can help you find recipes.",
    "what is your favorite color": "I like electric blue. Very virtual!",
    "can you sing": "Not yet, but I can help you play songs.",
    "tell me something interesting": "Octopuses have three hearts and blue blood!",
    "how old are you": "I'm as young as the last time my code was updated!",
    "can you speak other languages": "Right now I only speak English, but adding more is definitely possible!",
    "who is virat kohli": "Virat Kohli is an Indian cricketer and former captain of the Indian national team.",
    "who is narendra modi": "Narendra Modi is the Prime Minister of India.",
    "who is donald trump": "Donald Trump is a businessman and was the 45th President of the United States.",
    
    "who is bill gates": "Bill Gates is the co-founder of Microsoft and a philanthropist.",
    "who is steve jobs": "Steve Jobs was the co-founder of Apple Inc. and a pioneer of personal computing.",
    "who is ms dhoni": "MS Dhoni is a former captain of the Indian cricket team and a legendary wicketkeeper-batsman.",
    "who is sachin tendulkar": "Sachin Tendulkar is a legendary Indian cricketer, often called the 'God of Cricket'.",
    "who is barack obama": "Barack Obama was the 44th President of the United States.",
    "who is ratan tata": "Ratan Tata is an Indian industrialist and former chairman of Tata Group."
}
